core/app/Http/Controllers/SiteController.php

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1
---
    public function index()
    {
        $pageTitle = 'Home';
        $sections  = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();