core/app/Http/Controllers/Admin/CoinController.php

select * from `users` where `id` = 5 limit 1
select * from `orders` where `type` = 'sell_crypto' and `status` = 'pending' and (`deposit_code` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `type` = 'sell_crypto' and `status` = 'pending' and (`deposit_code` LIKE '%%')
---
    public function selllog(Request $request, $id)
    {
        $pageTitle       = 'Sales Log';
        $log = Order::whereType('sell_crypto')->whereStatus($id)->searchable(['deposit_code'])->with('asset', 'user')->orderBy('id', 'desc')->paginate(getPaginate());

select * from `orders` where `type` = 'sell_crypto' and `trx` = 'BTC45006' and `status` = 'pending' limit 1
update `orders` set `status` = 'success', `orders`.`updated_at` = '2024-08-24 01:18:14' where `id` = 172
update `users` set `ref_balance` = 161560, `users`.`updated_at` = '2024-08-24 01:18:15' where `id` = 5
insert into `transactions` (`user_id`, `amount`, `post_balance`, `charge`, `trx_type`, `details`, `trx`, `remark`, `updated_at`, `created_at`) values (5, '50160', '9022.00000000', 0, '+', 'Sold Bitcoin Digital Asset', 'BTC45006', 'sell_crypto', '2024-08-24 01:18:15', '2024-08-24 01:18:15')
---
    public function selllogApprove($id)
    {
        $order = Order::whereType('sell_crypto')->whereTrx($id)->whereStatus('pending')->firstOrFail();
        $order->status = 'success';
        $order->save();
        $user = User::whereId($order->user_id)->firstOrFail();
        $currency = Cryptocurrency::whereId($order->product_id)->firstOrFail();

          $user->balance += $order->value;


        $user->save();
        $transaction               = new Transaction();
        $transaction->user_id      = $order->user_id;
        $transaction->amount       = $order->value;
        $transaction->post_balance = $user->balance;
        $transaction->charge       = 0;
        $transaction->trx_type     = '+';
        $transaction->details      = 'Sold '. $currency->name.' Digital Asset';
        $transaction->trx          = $order->trx;
        $transaction->remark       = 'sell_crypto';
        $transaction->save();

select * from `orders` where `type` = 'buy_crypto' and `status` = 'success' and (`deposit_code` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `type` = 'buy_crypto' and `status` = 'success' and (`deposit_code` LIKE '%%')
---
    public function buylog(Request $request, $id)
    {
        $pageTitle       = 'Purchase Log';
        $log = Order::whereType('buy_crypto')->whereStatus($id)->searchable(['deposit_code'])->with('asset')->orderBy('id', 'desc')->paginate(getPaginate());