core/app/Http/Controllers/User/AirtimeController.php

    public function airtime(Request $request)
    {
        $pageTitle       = 'Airtime';
        $user = auth()->user();
        $log = Order::whereUserId($user->id)->whereType('airtime')->searchable(['trx'])->orderBy('id', 'desc')->paginate(getPaginate());
---
select * from `orders` where `user_id` = 5 and `type` = 'airtime' and (`trx` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `user_id` = 5 and `type` = 'airtime' and (`trx` LIKE '%%')