core/app/Http/Controllers/User/BuyCryptoController.php

select * from `cryptocurrencies` where `status` = 1
---
    public function buy(Request $request)
    {
        $pageTitle = 'Buy Crypto';
        $countries = [];
        $plans = [];
        $currencies = Cryptocurrency::whereStatus(1)->get();