core/app/Http/Controllers/User/ProfileController.php

    public function submitTrxPassword(Request $request)
    {

        $passwordValidation = Password::min(6);
        $general            = gs();

        $this->validate($request, [
            'password' => 'required',
            'pin' => 'required|min:4|max:6',
        ]);
        $user = auth()->user();
        if (Hash::check($request->password, $user->password)) {
            $password       = Hash::make($request->pin);
            $user->trx_password = $password;
            $user->save();
---
update `users` set `trx_password` = '$2y$10$DaXy0eJslSYs3IKpmr8kvuuatFY9ecKWYB4fXxpiDVR./nBx0epbi', `users`.`updated_at` = '2024-08-18 16:51:57' where `id` = 5