core/app/Http/Controllers/User/SellCryptoController.php

    public function sell(Request $request)
    {
        $pageTitle = 'Sell Crypto';
        $countries = [];
        $plans = [];
        $currencies = Cryptocurrency::whereStatus(1)->get();
---
select * from `cryptocurrencies` where `status` = 1

    public function sellConfirm()
    {
        $general = gs();
        $user = auth()->user();
        $json = file_get_contents('php://input');
        $input = json_decode($json, true);
        $coin = $input['coin'];
        $invoice = $input['invoice'];
        $currency = Cryptocurrency::whereSymbol($coin)->firstOrFail();
        $order = Order::whereTrx($invoice)->whereUserId($user->id)->firstOrFail();
---
select * from `cryptocurrencies` where `symbol` = 'BTC' limit 1
select * from `orders` where `trx` = 'BTC44968' and `user_id` = 5 limit 1

        //var_dump($resp);
        $resp = json_decode($resp,true);

        $trx = Transaction::whereTrx($order->trx)->whereUserId($user->id)->first();
---
select * from `transactions` where `trx` = 'BTC44968' and `user_id` = 5 limit 1

    public function sellConfirmManual(Request $request)
    {
        $general = gs();
        $user = auth()->user();
        $order = Order::whereTrx($request->trxhash)->whereUserId($user->id)->firstOrFail();
---
select * from `orders` where `trx` = 'undefined' and `user_id` = 5 limit 1

    public function log(Request $request)
    {
        $pageTitle       = 'Sales Log';
        $user = auth()->user();
        $log = Order::whereUserId($user->id)->whereType('sell_crypto')->searchable(['deposit_code'])->with('asset')->orderBy('id', 'desc')->paginate(getPaginate());
---
select * from `orders` where `user_id` = 5 and `type` = 'sell_crypto' and (`deposit_code` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `user_id` = 5 and `type` = 'sell_crypto' and (`deposit_code` LIKE '%%')