core/app/Http/Controllers/User/SellCryptoController.php

select * from `orders` where `user_id` = 5 and `type` = 'sell_crypto' and (`deposit_code` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `orders` where `user_id` = 5 and `type` = 'sell_crypto' and (`deposit_code` LIKE '%%')
---
    public function log(Request $request)
    {
        $pageTitle       = 'Sales Log';
        $user = auth()->user();
        $log = Order::whereUserId($user->id)->whereType('sell_crypto')->searchable(['deposit_code'])->with('asset')->orderBy('id', 'desc')->paginate(getPaginate());